balance-api/app/controllers/users_controller.rb

	def create
		# @user = User.new(:name => params[:new_user][:name], :location => params[:new_user][:location], :total_time => 0)
		@user = User.new(user_params)

		if @user.save
---
INSERT INTO "users" ("name", "location", "total_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jordan"], ["location", "San Francisco, CA"], ["total_time", 0.0], ["created_at", "2018-07-23 20:25:32.038837"], ["updated_at", "2018-07-23 20:25:32.038837"]]

	def login
		@user = User.find_by(:email => params[:login_user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jordan.kline@gmail.com"], ["LIMIT", 1]]